app/controllers/application_controller.rb

SELECT "fake_users".* FROM "fake_users" WHERE "fake_users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def find_current_user
    if session[:user_id]
      user = User.find_by(id: session[:user_id])