app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:session][:email])
---
SELECT "fake_users".* FROM "fake_users" WHERE "fake_users"."email" = ? LIMIT ?  [["email", "a@a.a"], ["LIMIT", 1]]