app/controllers/tictactoe_controller.rb

  def index
    @games = Tictactoe.all
---
SELECT "tictactoes".* FROM "tictactoes"

  def start
    amount = params[:tictactoe][:amount].to_i
    board = JSON.parse(params[:tictactoe][:board])  # Parse the board string into an array
    if @current_user.balance >= amount
      # Deduct balance before starting the game
      subtract_balance(amount)
      flash[:notice] = "#{amount} tokens have been subtracted from your balance."

      # Logic to start the game and initialize @tictactoe
      @tictactoe = Tictactoe.new(board: board)  # Pass the parsed board array
      @tictactoe.bet_amount = amount
      if @tictactoe.save
---
INSERT INTO "tictactoes" ("board", "created_at", "updated_at", "bet_amount") VALUES ($1, $2, $3, $4) RETURNING "id"  [["board", "---\n- \n- \n- \n- \n- \n- \n- \n- \n- \n"], ["created_at", "2024-05-23 09:37:46.893935"], ["updated_at", "2024-05-23 09:37:46.893935"], ["bet_amount", 20]]

  def show
    @tictactoe = Tictactoe.find(params[:id])
---
SELECT "tictactoes".* FROM "tictactoes" WHERE "tictactoes"."id" = ? LIMIT ?  [["id", 131], ["LIMIT", 1]]

  def create
    @tictactoe = Tictactoe.new(board: Array.new(9, nil), current_turn: 'X')
    if @tictactoe.save
---
INSERT INTO "tictactoes" ("board", "created_at", "updated_at") VALUES (?, ?, ?)  [["board", "---\n- \n- \n- \n- \n- \n- \n- \n- \n- \n"], ["created_at", "2024-05-21 21:06:22.268431"], ["updated_at", "2024-05-21 21:06:22.268431"]]

  def update
    @game = Tictactoe.find(params[:id])
---
SELECT "tictactoes".* FROM "tictactoes" WHERE "tictactoes"."id" = ? LIMIT ?  [["id", 132], ["LIMIT", 1]]

  def subtract_balance(amount)
    if @current_user.balance >= amount
      @current_user.update(balance: @current_user.balance - amount)
---
UPDATE "fake_users" SET "updated_at" = ?, "balance" = ? WHERE "fake_users"."id" = ?  [["updated_at", "2024-05-23 06:01:19.964175"], ["balance", 1660.0], ["id", 1]]