app/controllers/tictactoe_controller.rb

  def show

    @tictactoe = Tictactoe.find(params[:id])
---
SELECT "tictactoes".* FROM "tictactoes" WHERE "tictactoes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]