app/controllers/token_purchases_controller.rb

  def create
    amount = params[:amount].to_f
    @user = current_user

    if @user
      puts "User balance before purchase: #{@user.balance}"
      new_balance = @user.balance.to_f + amount
      if @user.update(balance: new_balance)
---
UPDATE "fake_users" SET "updated_at" = ?, "balance" = ? WHERE "fake_users"."id" = ?  [["updated_at", "2024-05-22 08:14:30.621770"], ["balance", 0], ["id", 1]]