app/controllers/token_purchases_controller.rb

SELECT "fake_users".* FROM "fake_users" WHERE "fake_users"."email" = ? LIMIT ?  [["email", "a@a.a"], ["LIMIT", 1]]
---
  def new_token_purchase
    @user = FakeUser.find_by(email: 'a@a.a')

SELECT "fake_users".* FROM "fake_users" WHERE "fake_users"."email" = ? LIMIT ?  [["email", "a@a.a"], ["LIMIT", 1]]
UPDATE "fake_users" SET "updated_at" = $1, "balance" = $2 WHERE "fake_users"."id" = $3  [["updated_at", "2024-05-23 09:35:37.090279"], ["balance", "300.0"], ["id", 8]]
---
  def create_token_purchase
    amount = params[:amount].to_f
    @user = FakeUser.find_by(email: 'a@a.a')
    if @user
      @user.update_attribute(:balance, @user.balance + amount)