app/controllers/users_controller.rb

INSERT INTO "fake_users" ("created_at", "updated_at", "email", "password_digest") VALUES (?, ?, ?, ?)  [["created_at", "2024-05-22 06:33:59.482303"], ["updated_at", "2024-05-22 06:33:59.482303"], ["email", "b@b.b"], ["password_digest", "$2a$12$jk3DNjuM8VLcnykcBU.y5eNuOzqcmq5Ev7AgWidl4d0UsNKwXAPqK"]]
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "fake_users" SET "updated_at" = ?, "balance" = ? WHERE "fake_users"."id" = ?  [["updated_at", "2024-05-23 03:07:46.507879"], ["balance", 150.0], ["id", 1]]
---
  def subtract_balance
    amount = params[:amount].to_i
    if @current_user.balance >= amount
      @current_user.update(balance: @current_user.balance - amount)