app/models/tictactoe.rb

  def update_winnings
    if game_over? && who_won? == "X"
      current_user = User.last
      current_user.balance = current_user.balance + (bet_amount * 2)
      current_user.save
---
SELECT "fake_users".* FROM "fake_users" ORDER BY "fake_users"."id" DESC LIMIT ?  [["LIMIT", 1]]
UPDATE "tictactoes" SET "board" = ?, "updated_at" = ? WHERE "tictactoes"."id" = ?  [["board", "---\n- X\n- O\n- \n- \n- \n- \n- \n- \n- \n"], ["updated_at", "2024-05-21 21:18:13.337106"], ["id", 14]]
UPDATE "fake_users" SET "updated_at" = ?, "balance" = ? WHERE "fake_users"."id" = ?  [["updated_at", "2024-05-23 06:25:54.422529"], ["balance", 1590.0], ["id", 1]]